# Analyzing Amazon Sales data

Sample Data Set containing Amazon Food category and showing types of food items purchased by respective customer

# In Data Analysis What All Things We Do

* Missing Values
* Explore About the Numerical Variables
* Explore About categorical Variables
* Finding Relationship between features

In [1]:
!pip install abc-analysis

Requirement already satisfied: abc-analysis in c:\users\aman\anaconda3\lib\site-packages (0.1.21)
Requirement already satisfied: numpy>=1.14 in c:\users\aman\anaconda3\lib\site-packages (from abc-analysis) (1.21.5)
Requirement already satisfied: scipy>=1.1.0 in c:\users\aman\anaconda3\lib\site-packages (from abc-analysis) (1.7.3)
Requirement already satisfied: matplotlib>=2.2.2 in c:\users\aman\anaconda3\lib\site-packages (from abc-analysis) (3.5.1)
Requirement already satisfied: pandas>=0.22 in c:\users\aman\anaconda3\lib\site-packages (from abc-analysis) (1.4.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (9.0.1)
Requirement already satisfied: cycler>=0.10 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (4.25.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (2.8.2)
Requirement already satisfied: packaging>=20.0 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (21.3)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (3.0.4)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\aman\anaconda3\lib\site-packages (from matplotlib>=2.2.2->abc-analysis) (1.3.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\aman\anaconda3\lib\site-packages (from pandas>=0.22->abc-analysis) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\aman\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2.2->abc-analysis) (1.16.0)

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from abc_analysis import abc_analysis
import matplotlib.ticker as mtick

In [4]:
data = pd.read_excel('SALESDATA.xls')

In [5]:
data.head()

,CustKey,DateKey,Discount Amount,Invoice Date,Invoice Number,Item Class,Item Number,Item,Line Number,List Price,...,Sales Amount,Sales Amount Based on List Price,Sales Cost Amount,Sales Margin Amount,Sales Price,Sales Quantity,Sales Rep,U/M,Unnamed: 20,Unnamed: 21
0,10000481,2017-04-30,-237.91,2017-04-30,100012,NaN,NaN,Urban Large Eggs,2000,0.00,...,237.91,0.00,0.0,237.91,237.910000,1,184,EA,NaN,U/M = unit of measure
1,10002220,2017-07-14,368.79,2017-07-14,100233,P01,20910,Moms Sliced Turkey,1000,824.96,...,456.17,824.96,0.0,456.17,456.170000,1,127,EA,NaN,NaN
2,10002220,2017-10-17,109.73,2017-10-17,116165,P01,38076,Cutting Edge Foot-Long Hot Dogs,1000,548.66,...,438.93,548.66,0.0,438.93,438.930000,1,127,EA,NaN,EA = each
3,10002489,2017-06-03,-211.75,2017-06-03,100096,NaN,NaN,Kiwi Lox,1000,0.00,...,211.75,0.00,0.0,211.75,211.750000,1,160,EA,NaN,NaN
4,10004516,2017-05-27,96627.94,2017-05-27,103341,P01,60776,High Top Sweet Onion,1000,408.52,...,89248.66,185876.60,0.0,89248.66,196.150901,455,124,SE,NaN,SE = some SI unit like kgs or gallons

In [6]:
data.describe()

,CustKey,Discount Amount,Invoice Number,Line Number,List Price,Order Number,Sales Amount,Sales Amount Based on List Price,Sales Cost Amount,Sales Margin Amount,Sales Price,Sales Quantity,Sales Rep,Unnamed: 20
count,6.528200e+04,65280.000000,65282.000000,65282.000000,65282.000000,65282.000000,65282.000000,65282.000000,65282.000000,65282.000000,65281.000000,65282.000000,65282.000000,0.0
mean,1.001770e+07,1855.574835,216223.662020,23713.849790,514.693380,180583.064352,2852.038373,4707.473613,1660.979228,1191.059145,283.615913,45.084311,137.422398,NaN
std,7.176148e+03,9037.140888,94992.281866,32664.024053,449.189182,67593.871116,15164.342107,20696.443785,9556.485250,5860.787502,252.876719,429.661793,26.643936,NaN
min,1.000045e+07,-255820.800000,100012.000000,1000.000000,0.000000,100838.000000,200.010000,0.000000,0.000000,-3932.930000,-5000.000000,-1.000000,103.000000,NaN
25%,1.001272e+07,246.037500,117931.000000,3000.000000,181.560000,115321.000000,308.387500,561.040000,167.790000,129.950000,100.070000,2.000000,113.000000,NaN
50%,1.001966e+07,441.760000,222869.500000,12000.000000,325.190000,203702.000000,553.940000,998.160000,304.500000,246.490000,183.757500,3.000000,134.000000,NaN
75%,1.002351e+07,999.760000,314318.750000,32000.000000,803.860000,218576.000000,1280.042500,2315.040000,687.320000,579.530000,448.220000,8.000000,160.000000,NaN
max,1.002758e+07,343532.660000,332842.000000,344000.000000,2760.700000,321532.000000,555376.000000,632610.160000,366576.000000,188800.000000,6035.000000,16000.000000,185.000000,NaN

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65282 entries, 0 to 65281
Data columns (total 22 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   CustKey                           65282 non-null  int64
 1   DateKey                           65282 non-null  datetime64[ns]
 2   Discount Amount                   65280 non-null  float64
 3   Invoice Date                      65282 non-null  datetime64[ns]
 4   Invoice Number                    65282 non-null  int64
 5   Item Class                        56993 non-null  object
 6   Item Number                       65241 non-null  object
 7   Item                              65282 non-null  object
 8   Line Number                       65282 non-null  int64
 9   List Price                        65282 non-null  float64
 10  Order Number                      65282 non-null  int64
 11  Promised Delivery Date            65282 non-null  datetime64[ns]
 12  Sales Amount                      65282 non-null  float64
 13  Sales Amount Based on List Price  65282 non-null  float64
 14  Sales Cost Amount                 65282 non-null  float64
 15  Sales Margin Amount               65282 non-null  float64
 16  Sales Price                       65281 non-null  float64
 17  Sales Quantity                    65282 non-null  int64
 18  Sales Rep                         65282 non-null  int64
 19  U/M                               65282 non-null  object
 20  Unnamed: 20                       0 non-null      float64
 21  Unnamed: 21                       4 non-null      object
dtypes: datetime64[ns](3), float64(8), int64(6), object(5)
memory usage: 11.0+ MB

In [8]:
data.shape

(65282, 22)

In [9]:
data.duplicated().sum()

0

In [11]:
data['Item'].value_counts()

Better Fancy Canned Sardines    1648
Ebony Prepared Salad            1471
Moms Sliced Turkey              1192
Imagine Popsicles               1191
Discover Manicotti              1126
                                ...
Fast Salted Pretzels               1
Great Bagels                       1
Imagine Frozen Cauliflower         1
Jeffers Corn Puffs                 1
Bravo Fancy Canned Sardines        1
Name: Item, Length: 657, dtype: int64

In [12]:
data['CustKey'].value_counts()

10025919    2760
10019194    2752
10012715    1431
10012226    1389
10025025    1143
            ...
10019469       1
10009660       1
10002140       1
10020227       1
10014059       1
Name: CustKey, Length: 615, dtype: int64

Total number of customers are 615

In [13]:
data1=data.copy()

In [15]:
data1.head()

,CustKey,DateKey,Discount Amount,Invoice Date,Invoice Number,Item Class,Item Number,Item,Line Number,List Price,...,Sales Amount,Sales Amount Based on List Price,Sales Cost Amount,Sales Margin Amount,Sales Price,Sales Quantity,Sales Rep,U/M,Unnamed: 20,Unnamed: 21
0,10000481,2017-04-30,-237.91,2017-04-30,100012,NaN,NaN,Urban Large Eggs,2000,0.00,...,237.91,0.00,0.0,237.91,237.910000,1,184,EA,NaN,U/M = unit of measure
1,10002220,2017-07-14,368.79,2017-07-14,100233,P01,20910,Moms Sliced Turkey,1000,824.96,...,456.17,824.96,0.0,456.17,456.170000,1,127,EA,NaN,NaN
2,10002220,2017-10-17,109.73,2017-10-17,116165,P01,38076,Cutting Edge Foot-Long Hot Dogs,1000,548.66,...,438.93,548.66,0.0,438.93,438.930000,1,127,EA,NaN,EA = each
3,10002489,2017-06-03,-211.75,2017-06-03,100096,NaN,NaN,Kiwi Lox,1000,0.00,...,211.75,0.00,0.0,211.75,211.750000,1,160,EA,NaN,NaN
4,10004516,2017-05-27,96627.94,2017-05-27,103341,P01,60776,High Top Sweet Onion,1000,408.52,...,89248.66,185876.60,0.0,89248.66,196.150901,455,124,SE,NaN,SE = some SI unit like kgs or gallons